Repository: carmenates09/wc-sermepa
Catalog: languages/wc_redsys_payment_gateway-*.po
Languages: es_es

source: Mcrypt extension is missing. Please, ask your hosting provider to enable it.
es_es: Falta la extensión Mcrypt. Por favor, solicita a tu proveedor de alojamiento que la active.

source: Please, get a new SHA256 key from your TPV and enter it in the plugin configuration. | <a href="%1$s">Hide Notice</a>
es_es: Por favor, obtén una nueva clave SHA256 en el panel de control del TPV e introdúcela en la configuración del plugin. | <a href="%1$s">Entendido, no volver a mostrar.</a>

source: Credit card (TPV Redsys)
es_es: Pago con tarjeta mediante pasarela de pago Redsys

source: Pay with credit card using Redsys TPV
es_es: Pagar con tarjeta de crédito usando la Pasarela RedSys

source: Redsys works by sending the user to Redsys to enter their payment information.
es_es: Este plugin envia al usuario a la pasarela de pago de Redsys para pagar.

source: You'll find previous version (SHA1) <a href="https://github.com/jesusangel/wc-sermepa/archive/88112586ed7b4a90fe55d20f70fcea169c046c0c.zip" target="_blank">here</a>
es_es: Puedes descargar la versión anterior (con la firma SHA1) <a href="https://github.com/jesusangel/wc-sermepa/archive/88112586ed7b4a90fe55d20f70fcea169c046c0c.zip" target="_blank">aquí</a>

source: Gateway Disabled
es_es: Pasarela desactivada

source: Redsys does not support your store currency.
es_es: Redsys no soporta la moneda de su tienda.

source: Enable/Disable
es_es: Activar/Desactivar

source: Enable/Disable payment method.
es_es: Activa/Desactiva el método de pago.

source: Enable Redsys
es_es: Activar Redsys

source: Mode
es_es: Modo de funcionamiento

source: Production
es_es: Producción

source: Test sis-t
es_es: Pruebas con el entorno sis-t

source: Test sis-d
es_es: Pruebas con el entorno sis-d

source: Test sis-i
es_es: Pruebas con el entorno sis-i

source: TVP mode: production or test
es_es: Modo de funcionamiento del TPV: producción o pruebas (sis-t, sis-d o sis-i)

source: Notifications protocol
es_es: Protocolo para notificaciones

source: Protocol
es_es: Protocolo

source: Auto
es_es: Automático

source: Protocol to use by RedSYS notififications. HTTPS works only for sites with SSL and dedicated IP. Redsys doesn't work with SNI (22/05/2016)
es_es: Protocolo para la URL de notificaciones de RedSYS. HTTPS sólo funciona para sitios con SSL e IP dedicada (no compartida). RedSys no soporta SNI (a fecha 22/05/2016).

source: Title
es_es: Título

source: This controls the title which the user sees during checkout.
es_es: Esto controla el título que el usuario ve durante la finalización de la compra.

source: Description
es_es: Descripción

source: This controls the description which the user sees during checkout.
es_es: Ésto controla la descripción que los usuarios verán durante la finalización de la compra.

source: Payment gateway with Redsys credit card.
es_es: Pago con tarjeta mediante pasarela de pago (Redsys)

source: Allowed payment methods
es_es: Métodos de pago aceptados

source: Allowed payment methods.
es_es: Métodos de pago aceptados.

source: All
es_es: Todos

source: Only credit card
es_es: Sólo tarjeta

source: Credit card and Iupay
es_es: Tarjeta y Iupay

source: Owner name
es_es: Nombre del comercio

source: Name and surname of the owner.
es_es: Nombre y apellidos del propietario

source: Commerce name
es_es: Nombre del comercio

source: The commerce name.
es_es: Nombre del comercio

source: Commerce number (FUC)
es_es: Número de comercio (FUC)

source: Please enter your Redsys commerce number (FUC); this is needed in order to take payment.
es_es: Por favor, introduzca su número de comercio (FUC) de redsys, esto es necesario con el fin de recibir el pago.

source: Terminal number
es_es: Número de terminal

source: Please enter your Redsys terminal number; this is needed in order to take payment.
es_es: Por favor, introduzca su número de terminal de Redsys, esto es necesario con el fin de recibir el pago.

source: Currency identifier
es_es: Identificador de moneda

source: Please enter your Redsys currency identifier; this is needed in order to take payment.
es_es: Por favor, introduzca el identificador de moneda de su terminal, esto es necesario con el fin de recibir el pago.

source: Secret key (SHA-256)
es_es: Clave secreta (SHA 256)

source: Please enter your secret key; this is needed in order to take payment.
es_es: Por favor, introduzca la clave secreta del comercio; es necesario para recibir los pagos.

source: Enable languages
es_es: Usar idioma del usuario en la pasarela de RedSYS

source: Shows TPV with customer's language.
es_es: Mostrar TPV con el idioma del cliente.

source: Skip checkout form
es_es: Omitir el formulario de finalizar compra

source: Skip the last form of the checkout process and redirect into the payment gateway (requires Javascript).
es_es: Omitir el último formulario del proceso de finalizar compra y redirigir a la pasarela de pago (requiere Javascript).

source: Gateway Testing
es_es: Modo de pruebas

source: Debug Log
es_es: Registro de depuración

source: Enable logging
es_es: Activar registro

source: Log Redsys events, inside %s
es_es: Registrar eventos RedSYS en %s

source: Online order
es_es: Compra online

source: Thank you for your order. You are being redirected to the payment gateway.
es_es: Gracias por su pedido. Está siendo redirigido a la pasarela de pago.

source: Pay via Redsys
es_es: Pagar mediante Redsys

source: Cancel order &amp; restore cart
es_es: Cancelar el pedido

source: Thank you for your order, please click the button below to pay with Redsys.
es_es: Gracias por su pedido. Por favor, pulse sobre el botón para pagar.

source: Validation error: Redsys amounts do not match (amount %s).
es_es: Error de validación: los importes no coinciden (total %s).

source: Redsys payment completed
es_es: Pago completado

source: Payment error: code: %s.
es_es: Error en el pago: código %s.

source: Payment error: bank unavailable.
es_es: Error en el pago: banco no disponible.

source: Awaiting REDSYS payment
es_es: Esperando pago con tarjeta

source: Mcrypt extension is not available in this server
es_es: La extensión Mcrypt no está activada en este servidor

source: WooCommerce Redsys payment gateway
es_es: Pasarela de pago de Redsys para WooCommerce

source: Redsys payment gateway for WooCommerce
es_es: Pasarela de pago de Redsys para WooCommerce
